src/Documents/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Проекты</name>
  <attributes>
    <name>НазваниеПроекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РуководительПроекта</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КомандаПроекта</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>НеобходимыйПроцентЗанятостиНаПроекте</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ИсторияПроектов/ИсторияПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияПроектов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>РуководительПроекта</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>НазваниеПроекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>DocumentRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЗаписи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ИсторияСотрудниковНаПроекте/ИсторияСотрудниковНаПроекте.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияСотрудниковНаПроекте</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>НеобходимыйПроцентЗанятостиНаПроекте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИДЗаписиВИсторииПроектов</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/Проекты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

////{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
//	//Данный фрагмент построен конструктором.
//	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!
//
//	// регистр ИсторияПроектов
//	Движения.ИсторияПроектов.Записывать = Истина;
//	Движение = Движения.ИсторияПроектов.Добавить();
//	Движение.НазваниеПроекта = НазваниеПроекта;
//	Движение.РуководительПроекта = РуководительПроекта;
//	Движение.ДатаНачала = ДатаНачала;
//	Движение.ДатаОкончания = ДатаОкончания;
//	Движение.Период = ТекущаяДатаСеанса();	
//	Движение.Идентификатор = Новый УникальныйИдентификатор(); 
//	Движения.ИсторияПроектов.Записать(Ложь);
//	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
////	СсылкаНаЗапись = Движение.НомерСтроки;
	
	
МенеджерЗаписи = РегистрыСведений.ИсторияПроектов.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Проект = Ссылка;
	МенеджерЗаписи.НазваниеПроекта = НазваниеПроекта;
	МенеджерЗаписи.РуководительПроекта = РуководительПроекта;
	МенеджерЗаписи.ДатаНачала = ДатаНачала;
	МенеджерЗаписи.ДатаОкончания = ДатаОкончания;
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	
	УникальныйИдентификатор = Новый УникальныйИдентификатор();	
	МенеджерЗаписи.ИдентификаторЗаписи = УникальныйИдентификатор; 	

МенеджерЗаписи.Записать();	


МенеджерЗаписи = РегистрыСведений.ИсторияСотрудниковНаПроекте.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.ИДЗаписиВИсторииПроектов = УникальныйИдентификатор;

МенеджерЗаписи.Записать();	
	


//НаборЗаписей = РегистрыСведений.ИсторияПроектов.СоздатьНаборЗаписей(); 
//    НаборЗаписей.Отбор.НазваниеПроекта.Установить(НазваниеПроекта);
//НаборЗаписей.Записать(); 

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
